app/controllers/ideas_controller.rb

SELECT "ideas".* FROM "ideas"
---
  def index
    @ideas = Idea.all

INSERT INTO "ideas" ("name", "description", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["description", ""], ["picture", ""], ["created_at", "2021-02-23 18:39:45.854258"], ["updated_at", "2021-02-23 18:39:45.854258"]]
---
  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save

UPDATE "ideas" SET "description" = ?, "updated_at" = ? WHERE "ideas"."id" = ?
---
  def update
    respond_to do |format|
      if @idea.update(idea_params)

DELETE FROM "ideas" WHERE "ideas"."id" = ?  [["id", 2]]
---
  def destroy
    @idea.destroy

SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_idea
      @idea = Idea.find(params[:id])